"""
2. Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123].
"""

# пока не знаю, какой вариант мне нравится больше
old_list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
new_list = [el for el in old_list if el > old_list[old_list.index(el)-1]]
#second_new_list = [el for num, el in enumerate(old_list) if old_list[num - 1] < old_list[num]]
print(f'Исходный список: {old_list}')
print(f'Результат: {new_list}')
#print(f'Результат: {second_new_list}')

